blog/2019/07/nixos/index.org
#+TITLE: NixOS
#+DESCRIPTION: NixOS
#+TAGS: GNU/Linux
#+TAGS: nixos
#+TAGS: nix
#+DATE: 2019-07-19
#+SLUG: nixos
#+LINK: ansible https://www.ansible.com/
#+LINK: configuration-management-wiki https://en.wikipedia.org/wiki/Software_configuration_management
#+LINK: fhs https://refspecs.linuxfoundation.org/fhs.shtml
#+LINK: glibc https://www.gnu.org/software/libc/
#+LINK: gnu https://www.gnu.org
#+LINK: guile-scheme https://www.gnu.org/software/guile/
#+LINK: guix https://guix.gnu.org/
#+LINK: linux https://www.kernel.org/
#+LINK: man-symlink-2 http://man7.org/linux/man-pages/man2/symlink.2.html
#+LINK: mozilla-firefox https://www.mozilla.org/en-US/firefox/
#+LINK: nftables https://wiki.nftables.org/wiki-nftables/index.php/Main_Page
#+LINK: nix https://nixos.org/nix/
#+LINK: nix-expression https://nixos.wiki/wiki/Nix_Expression_Language
#+LINK: nix-expressions https://nixos.wiki/wiki/Nix_Expression_Language
#+LINK: nix-paper https://www.usenix.org/legacy/events/lisa04/tech/full_papers/dolstra/dolstra.pdf
#+LINK: nixos https://nixos.org/
#+LINK: nixos-manual https://nixos.org/nixos/manual/index.html
#+LINK: nixos-paper https://nixos.org/~eelco/pubs/nixos-icfp2008-final.pdf
#+LINK: puppet https://puppet.com/
#+LINK: python https://python.org
#+LINK: salt-stack https://www.saltstack.com/
#+LINK: wiki-dsl https://en.wikipedia.org/wiki/Domain-specific_language
#+LINK: wiki-dsl https://en.wikipedia.org/wiki/Domain-specific_language
#+LINK: wiki-luks https://en.wikipedia.org/wiki/Linux_Unified_Key_Setup
#+LINK: wiki-raid https://en.wikipedia.org/wiki/RAID
#+LINK: wiki-unix-epoch https://en.wikipedia.org/wiki/Unix_time

#+BEGIN_PREVIEW
[[nixos][NixOS]] is a new kind of [[gnu][GNU]]/[[linux][Linux]] distribution, borrowing the ideas of
functional programming languages to bring about a revolution of how we think
about operating systems and software development.
#+END_PREVIEW

** NixOS
:PROPERTIES:
:ID:       09a7cc51-527a-4c65-8eb8-dedcdff2004d
:END:

[[nixos][NixOS]] is a "functional" [[gnu][GNU]]/[[linux][Linux]] distribution
extending the ideas of functional programming languages to operating systems.

To illustrate, most operating systems are more analogous to imperative
languages where the programmer instructs, via the various incantations of the
language, the computer to perform some operation.  Many of these instructions
modify state-- variables, files, network packets.  Functional programming
languages can be instructive, but many of them feel more declarative in nature.
That is, instead of telling what the computer to do, the programmer defines the
result of the computation.  Side-effects, as they are known, are either
disallowed completely or require a certain amount of "ceremony" to be
performed.

Following this imperfect analogy, [[gnu][GNU]]/[[linux][Linux]] distributions
typically follow the imperative paradigm: the operator issues instructions that
modify the state of the system.  Installing and configuring some software
package, for example, requires the operator to run a series of commands that
first install the package, another series of commands to configure the software
to the desired state, and finally, the system and the resulting software is
ready for use.

In contrast, [[nixos][NixOS]] follows the functional paradigm.  The entire
system, from the boot loader to the available software and its configuration
can all be traced to a single file: ~/etc/nixos/configuration.nix~.

In the system configuration file for [[nixos][NixOS]], we declare the various
end states of the system:

- system packages

- system services

- users and groups

- kernel modules loaded during boot

- boot loader configuration

- mount points

The vast majority of the system can be codified into this configuration file.
Currently missing is disk partitioning and allocation and user data.

To understand better the concepts behind [[nixos][NixOS]], we will take a brief
detour through [[nix][Nix]], the package manager.

*** Nix (the package manager)
:PROPERTIES:
:ID:       24f226f1-5bdc-4253-8e67-4b6853e740b8
:END:

Beyond the comparisons of language paradigms, there are some other _really_
neat ideas that come from the [[nix][Nix]] family.  Specifically, I want to
discuss the dependency management of [[nix][Nix]] and, therefore,
[[nixos][NixOS]].

Recall the description of the "imperative" operating systems above: many
software packages have dependencies on various other components and packages.
Typically the distribution managers resolve the dependencies into a coherent
tree such that all packages resolve to the correct (read available) version of
[[glibc][~glibc~]].  However, maintainers are human and maintainership is
non-trivial.  Packages slip through, and core breakages happen.  Worse, the
possible matrix of configurations and various packages is mind-numbingly
large.

Concretely, what this may look like can be demonstrated by a simple example.
Let's say an operator installs package ~A~ which depends on package ~C~.
Later, our example operator installs another package ~B~, which also depends on
package ~C~.  For now, we will say that package ~C~ is the same version.  So
far, all is good.  Nothing is broken, and the system is stable.  However, some
time later, package ~B~ needs to be updated and causes a resulting update to
package ~C~.  Now package ~A~ may not work.  Its version of package ~C~ is now
replaced by the version pulled in by package ~B~.  This may be fine, but by a
similar token, it may also be plainly broken.  Worse, it may be only _subtly_
broken, the breakage is not noticed by cursory testing.

Using [[nix][Nix]], this situation is impossible.  Package ~A~ has its own
complete dependency graph, including package ~C~'s dependency graph.  The same
holds for package ~B~, [[nix][Nix]] stores the entire dependency graph of each
package separate from each other package.

Therefore, given our above example of package management mishaps, when package
~B~ updates and pulls in a new version of package ~C~.  The version of ~C~ used
by ~A~ is left untouched and package ~A~ works just the same as before.

