blog/2019/07/nixos/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-07-06 Thu 08:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>NixOS</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="kb" />
<meta name="description" content="NixOS"
 />
<meta charset="utf-8">

<meta name="author" content="Kenny Ballou">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

<title>~kb</title>

<link rel="canonical" href="/" />
<link href="/index.xml" rel="alternate" type="application/rss+xml"
      title="~kb/blog" />

<link rel="stylesheet" href="/css/simple.css" />
<link rel="stylesheet" href="/css/simple.add.css" />
<link rel="stylesheet" href="/css/katex.css" />
<link rel="stylesheet" href="/css/fa-all.css" />
<link rel="shortcut icon" href="/favicon.ico" type="image/x-icon" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://kennyballou.com/blog"> UP </a>
 |
 <a accesskey="H" href="https://kennyballou.com/"> HOME </a>
</div><header id="" class="status">
<nav>
  <a href="/">
    <i class="fade fas fa-home"></i>
  </a>
  <a href="/about.html">
    <i class="fade fas fa-user-circle"></i>
  </a>
  <a href="https://git.sr.ht/~kennyballou/"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fas fa-code-branch fa-1x"></i>
  </a>
  <a href="https://github.com/kennyballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-github fa-1x"></i>
  </a>
  <a href="https://bitbucket.org/kballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-bitbucket fa-1x"></i>
  </a>
  <a href="https://linkedin.com/in/kennyballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-linkedin-in fa-1x"></i>
  </a>
  <a href="/support.html">
    <i class="fade fas fa-heart fa-1x"></i>
  </a>
  <a href="/resume.pdf"
     target="_blank">
    <i class="fade far fa-file-pdf"></i>
  </a>
  <a href="/B74CC4B41148C3DB364BC21182D94B35744E1B34.asc"
     target="_blank">
    <i class="fade fas fa-key"></i>
  </a>
  <a href="/index.xml" rel="alternate"
     type="application/rss+xml">
    <i class="fade fas fa-rss fa-1x"></i>
  </a>
</nav>
</header>
<div id="main">
<h1 class="title">NixOS</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga25ee05">NixOS</a>
<ul>
<li><a href="#orgeeb635f">Nix (the package manager)</a></li>
<li><a href="#orgb576bbd">Nix Store</a></li>
<li><a href="#orgb63c879">Nix Profiles</a></li>
<li><a href="#orged89f96">System Profiles</a></li>
</ul>
</li>
<li><a href="#orgaae25a7">Alternatives</a></li>
<li><a href="#orgdc162e6">Impressions and Thoughts</a></li>
</ul>
</div>
</div>
<div class="PREVIEW">
<p>
<a href="https://nixos.org/">NixOS</a> is a new kind of <a href="https://www.gnu.org">GNU</a>/<a href="https://www.kernel.org/">Linux</a> distribution, borrowing the ideas of
functional programming languages to bring about a revolution of how we think
about operating systems and software development.
</p>

</div>

<div id="outline-container-orga25ee05" class="outline-2">
<h2 id="orga25ee05">NixOS</h2>
<div class="outline-text-2" id="text-orga25ee05">
<p>
<a href="https://nixos.org/">NixOS</a> is a "functional" <a href="https://www.gnu.org">GNU</a>/<a href="https://www.kernel.org/">Linux</a> distribution
extending the ideas of functional programming languages to operating systems.
</p>

<p>
To illustrate, most operating systems are more analogous to imperative
languages where the programmer instructs, via the various incantations of the
language, the computer to perform some operation.  Many of these instructions
modify state&#x2013; variables, files, network packets.  Functional programming
languages can be instructive, but many of them feel more declarative in nature.
That is, instead of telling what the computer to do, the programmer defines the
result of the computation.  Side-effects, as they are known, are either
disallowed completely or require a certain amount of "ceremony" to be
performed.
</p>

<p>
Following this imperfect analogy, <a href="https://www.gnu.org">GNU</a>/<a href="https://www.kernel.org/">Linux</a> distributions
typically follow the imperative paradigm: the operator issues instructions that
modify the state of the system.  Installing and configuring some software
package, for example, requires the operator to run a series of commands that
first install the package, another series of commands to configure the software
to the desired state, and finally, the system and the resulting software is
ready for use.
</p>

<p>
In contrast, <a href="https://nixos.org/">NixOS</a> follows the functional paradigm.  The entire
system, from the boot loader to the available software and its configuration
can all be traced to a single file: <code>/etc/nixos/configuration.nix</code>.
</p>

<p>
In the system configuration file for <a href="https://nixos.org/">NixOS</a>, we declare the various
end states of the system:
</p>

<ul class="org-ul">
<li>system packages</li>

<li>system services</li>

<li>users and groups</li>

<li>kernel modules loaded during boot</li>

<li>boot loader configuration</li>

<li>mount points</li>
</ul>

<p>
The vast majority of the system can be codified into this configuration file.
Currently missing is disk partitioning and allocation and user data.
</p>

<p>
To understand better the concepts behind <a href="https://nixos.org/">NixOS</a>, we will take a brief
detour through <a href="https://nixos.org/nix/">Nix</a>, the package manager.
</p>
</div>

<div id="outline-container-orgeeb635f" class="outline-3">
<h3 id="orgeeb635f">Nix (the package manager)</h3>
<div class="outline-text-3" id="text-orgeeb635f">
<p>
Beyond the comparisons of language paradigms, there are some other <span class="underline">really</span>
neat ideas that come from the <a href="https://nixos.org/nix/">Nix</a> family.  Specifically, I want to
discuss the dependency management of <a href="https://nixos.org/nix/">Nix</a> and, therefore,
<a href="https://nixos.org/">NixOS</a>.
</p>

<p>
Recall the description of the "imperative" operating systems above: many
software packages have dependencies on various other components and packages.
Typically the distribution managers resolve the dependencies into a coherent
tree such that all packages resolve to the correct (read available) version of
<a href="https://www.gnu.org/software/libc/"><code>glibc</code></a>.  However, maintainers are human and maintainership is
non-trivial.  Packages slip through, and core breakages happen.  Worse, the
possible matrix of configurations and various packages is mind-numbingly
large.
</p>

<p>
Concretely, what this may look like can be demonstrated by a simple example.
Let's say an operator installs package <code>A</code> which depends on package <code>C</code>.
Later, our example operator installs another package <code>B</code>, which also depends on
package <code>C</code>.  For now, we will say that package <code>C</code> is the same version.  So
far, all is good.  Nothing is broken, and the system is stable.  However, some
time later, package <code>B</code> needs to be updated and causes a resulting update to
package <code>C</code>.  Now package <code>A</code> may not work.  Its version of package <code>C</code> is now
replaced by the version pulled in by package <code>B</code>.  This may be fine, but by a
similar token, it may also be plainly broken.  Worse, it may be only <span class="underline">subtly</span>
broken, the breakage is not noticed by cursory testing.
</p>

<p>
Using <a href="https://nixos.org/nix/">Nix</a>, this situation is impossible.  Package <code>A</code> has its own
complete dependency graph, including package <code>C</code>'s dependency graph.  The same
holds for package <code>B</code>, <a href="https://nixos.org/nix/">Nix</a> stores the entire dependency graph of each
package separate from each other package.
</p>

<p>
Therefore, given our above example of package management mishaps, when package
<code>B</code> updates and pulls in a new version of package <code>C</code>.  The version of <code>C</code> used
by <code>A</code> is left untouched and package <code>A</code> works just the same as before.
</p>
</div>
</div>
