blog/2019/07/nixos/index.html

<div id="outline-container-orgb576bbd" class="outline-3">
<h3 id="orgb576bbd">Nix Store</h3>
<div class="outline-text-3" id="text-orgb576bbd">
<p>
After examining the above example, how does <a href="https://nixos.org/nix/">Nix</a> accomplish this?
</p>

<p>
If we think about the <a href="https://refspecs.linuxfoundation.org/fhs.shtml">Filesystem Hierarchy Standard</a>, an executable
package is installed into some <code>bin</code> directory, its dynamically linked objects
are in a <code>lib</code> directory, its configuration may be in a <code>etc</code> directory.
</p>

<p>
With a <a href="https://nixos.org/nix/">Nix</a> package, the package has all same directories, however,
they are isolated in the "store".  The <a href="https://nixos.org/nix/">Nix</a> store is typically a
directory <code>/nix/store/</code> that contains each package in its <code>hash-name-version</code>
folder.  For example, let's look at <a href="https://www.mozilla.org/en-US/firefox/">Firefox</a>:
</p>

<pre class="example">
% ls -al $(which firefox)
lrwxrwxrwx 1 root root 68 Dec 31  1969 /run/current-system/sw/bin/firefox -&gt; /nix/store/78gl44fjjira5jsgyj8vdwsnw8wdwngs-firefox-68.0/bin/firefox
% ls -l /nix/store/78gl44fjjira5jsgyj8vdwsnw8wdwngs-firefox-68.0/
total 0
dr-xr-xr-x 2 root root 21 Dec 31  1969 bin
dr-xr-xr-x 3 root root 21 Dec 31  1969 lib
dr-xr-xr-x 2 root root 42 Dec 31  1969 nix-support
dr-xr-xr-x 4 root root 39 Dec 31  1969 share
</pre>

<p>
There's a few things to notice here.  One, the directories are all read-only;
two, the modified time is set to <a href="https://en.wikipedia.org/wiki/Unix_time">UNIX Epoch</a>; third, the
entire folder structure necessary for <a href="https://www.mozilla.org/en-US/firefox/">Firefox</a> to run is in
this store.
</p>

<p>
Let's examine a package that requires dynamic linking to correctly execute, the
<a href="https://python.org">Python</a> interpreter:
</p>

<pre class="example">
% ls -l $(which python)
lrwxrwxrwx 1 root root 68 Dec 31  1969 /run/current-system/sw/bin/python -&gt; /nix/store/dmh36s38dcpc91grfsh6wqrm65rz5hfh-pythonOverlay/bin/python
% ls -l /nix/store/dmh36s38dcpc91grfsh6wqrm65rz5hfh-pythonOverlay
total 4
dr-xr-xr-x 2 root root 4096 Dec 31  1969 bin
lrwxrwxrwx 1 root root   65 Dec 31  1969 include -&gt; /nix/store/10rqw9cx8x2knwdaxhlyb4drla8v8zzk-python3-3.7.4/include
dr-xr-xr-x 3 root root  113 Dec 31  1969 lib
dr-xr-xr-x 3 root root   17 Dec 31  1969 share
</pre>

<p>
Now, let's examine the linked objects:
</p>

<pre class="example">
% ldd $(which python)
linux-vdso.so.1 (0x00007ffd3c3d9000)
libpython3.7m.so.1.0 =&gt; /nix/store/10rqw9cx8x2knwdaxhlyb4drla8v8zzk-python3-3.7.4/lib/libpython3.7m.so.1.0 (0x00007f6ccf964000)
libpthread.so.0 =&gt; /nix/store/681354n3k44r8z90m35hm8945vsp95h1-glibc-2.27/lib/libpthread.so.0 (0x00007f6ccf943000)
libdl.so.2 =&gt; /nix/store/681354n3k44r8z90m35hm8945vsp95h1-glibc-2.27/lib/libdl.so.2 (0x00007f6ccf93e000)
libcrypt.so.1 =&gt; /nix/store/681354n3k44r8z90m35hm8945vsp95h1-glibc-2.27/lib/libcrypt.so.1 (0x00007f6ccf904000)
libncursesw.so.6 =&gt; /nix/store/adc71v5apk4dzcxg7cjqgszjg1a6pd0z-ncurses-6.1-20190112/lib/libncursesw.so.6 (0x00007f6ccf892000)
libutil.so.1 =&gt; /nix/store/681354n3k44r8z90m35hm8945vsp95h1-glibc-2.27/lib/libutil.so.1 (0x00007f6ccf88b000)
libm.so.6 =&gt; /nix/store/681354n3k44r8z90m35hm8945vsp95h1-glibc-2.27/lib/libm.so.6 (0x00007f6ccf6f5000)
libgcc_s.so.1 =&gt; /nix/store/681354n3k44r8z90m35hm8945vsp95h1-glibc-2.27/lib/libgcc_s.so.1 (0x00007f6ccf4df000)
libc.so.6 =&gt; /nix/store/681354n3k44r8z90m35hm8945vsp95h1-glibc-2.27/lib/libc.so.6 (0x00007f6ccf329000)
/nix/store/681354n3k44r8z90m35hm8945vsp95h1-glibc-2.27/lib/ld-linux-x86-64.so.2 =&gt; /nix/store/681354n3k44r8z90m35hm8945vsp95h1-glibc-2.27/lib64/ld-linux-x86-64.so.2 (0x00007f6ccfccf000)
</pre>

<p>
Each of the linked objects, sans the kernel object, are found in the
<a href="https://nixos.org/nix/">Nix</a> store.
</p>

<p>
Furthermore, if we examine the <a href="https://python.org">Python</a> <code>lib</code> folder:
</p>

<pre class="example">
% ls -l /nix/store/dmh36s38dcpc91grfsh6wqrm65rz5hfh-pythonOverlay/lib
total 12
lrwxrwxrwx 1 root root   78 Dec 31  1969 libpython3.7m.so -&gt; /nix/store/10rqw9cx8x2knwdaxhlyb4drla8v8zzk-python3-3.7.4/lib/libpython3.7m.so
lrwxrwxrwx 1 root root   82 Dec 31  1969 libpython3.7m.so.1.0 -&gt; /nix/store/10rqw9cx8x2knwdaxhlyb4drla8v8zzk-python3-3.7.4/lib/libpython3.7m.so.1.0
lrwxrwxrwx 1 root root   75 Dec 31  1969 libpython3.so -&gt; /nix/store/10rqw9cx8x2knwdaxhlyb4drla8v8zzk-python3-3.7.4/lib/libpython3.so
lrwxrwxrwx 1 root root   71 Dec 31  1969 pkgconfig -&gt; /nix/store/10rqw9cx8x2knwdaxhlyb4drla8v8zzk-python3-3.7.4/lib/pkgconfig
dr-xr-xr-x 3 root root 8192 Dec 31  1969 python3.7
</pre>

<p>
The shared objects and folders are also symbolic links to other packages and
folders in the <a href="https://nixos.org/nix/">Nix</a> store.
</p>

<p>
This leads us to the following observation: packages in the <a href="https://nixos.org/nix/">Nix</a> store
are comprised of the outputs of the package and associated symbolic links to
the package's inputs.
</p>
</div>
</div>
