blog/2019/07/nixos/index.html

<div id="outline-container-orgb63c879" class="outline-3">
<h3 id="orgb63c879">Nix Profiles</h3>
<div class="outline-text-3" id="text-orgb63c879">
<p>
Packages in <a href="https://nixos.org/nix/">Nix</a> are directory trees found in the <a href="https://nixos.org/nix/">Nix</a> store,
what are profiles?  Perhaps, more appropriately, what are user environments?
</p>

<p>
When setting up <a href="https://nixos.org/nix/">Nix</a> as a package manager either in <a href="https://nixos.org/">NixOS</a> or
a different <a href="https://www.gnu.org">GNU</a>/<a href="https://www.kernel.org/">Linux</a> distribution, there's typically a
symbolic link in the user's home directory:
</p>

<pre class="example">
% ls -l ~/.nix-profile
lrwxrwxrwx 1 kb users 41 May 15  2017 /home/kb/.nix-profile -&gt; /nix/var/nix/profiles/per-user/kb/profile
</pre>

<p>
However, this link is to another link.  Let's follow the rabbit:
</p>

<pre class="example">
% ls -l /nix/var/nix/profiles/per-user/kb/profile
lrwxrwxrwx 1 kb users 14 Jul 30 15:15 /nix/var/nix/profiles/per-user/kb/profile -&gt; profile-3-link
</pre>

<p>
This indirect symbolic link points to a symbolic link in the same directory.
Let's keep following:
</p>

<pre class="example">
% ls -l /nix/var/nix/profiles/per-user/kb/profile-3-link
lrwxrwxrwx 1 kb users 60 Jul 30 15:15 /nix/var/nix/profiles/per-user/kb/profile-3-link -&gt; /nix/store/d7d6hcv8v2crb98nhh00nrr2bkh034kc-user-environment
% ls -l /nix/store/d7d6hcv8v2crb98nhh00nrr2bkh034kc-user-environment
dr-xr-xr-x 2 root root 156 Dec 31  1969 bin
lrwxrwxrwx 1 root root  63 Dec 31  1969 etc -&gt; /nix/store/k0hyks88khah4hvb19i0d6swsawyzz5a-awscli-1.16.170/etc
dr-xr-xr-x 2 root root  35 Dec 31  1969 lib
lrwxrwxrwx 1 root root  60 Dec 31  1969 manifest.nix -&gt; /nix/store/lqc7v4cb77fzgnrqn0miz1fpkzb3dxc2-env-manifest.nix
lrwxrwxrwx 1 root root  65 Dec 31  1969 share -&gt; /nix/store/k0hyks88khah4hvb19i0d6swsawyzz5a-awscli-1.16.170/share
</pre>

<p>
After following three links, we are referred to a directory tree in the
<a href="https://nixos.org/nix/">Nix</a> store.
</p>

<p>
Let's examine the <code>bin</code> directory quickly:
</p>

<pre class="example">
% ls -l /nix/store/d7d6hcv8v2crb98nhh00nrr2bkh034kc-user-environment/bin
total 0
lrwxrwxrwx 1 root root 67 Dec 31  1969 aws -&gt; /nix/store/k0hyks88khah4hvb19i0d6swsawyzz5a-awscli-1.16.170/bin/aws
lrwxrwxrwx 1 root root 82 Dec 31  1969 aws_bash_completer -&gt; /nix/store/k0hyks88khah4hvb19i0d6swsawyzz5a-awscli-1.16.170/bin/aws_bash_completer
lrwxrwxrwx 1 root root 77 Dec 31  1969 aws_completer -&gt; /nix/store/k0hyks88khah4hvb19i0d6swsawyzz5a-awscli-1.16.170/bin/aws_completer
lrwxrwxrwx 1 root root 89 Dec 31  1969 cargo-generate-nixfile -&gt; /nix/store/s11zqp9r8h4r65iqv272b477igb9a9mw-rust_carnix-0.10.0/bin/cargo-generate-nixfile
lrwxrwxrwx 1 root root 91 Dec 31  1969 cargo_generate_nixfile.d -&gt; /nix/store/s11zqp9r8h4r65iqv272b477igb9a9mw-rust_carnix-0.10.0/bin/cargo_generate_nixfile.d
lrwxrwxrwx 1 root root 73 Dec 31  1969 carnix -&gt; /nix/store/s11zqp9r8h4r65iqv272b477igb9a9mw-rust_carnix-0.10.0/bin/carnix
lrwxrwxrwx 1 root root 75 Dec 31  1969 carnix.d -&gt; /nix/store/s11zqp9r8h4r65iqv272b477igb9a9mw-rust_carnix-0.10.0/bin/carnix.d
</pre>

<p>
Currently, this example profile only has two packages installed:
</p>

<pre class="example">
% nix-env -q
awscli-1.16.170
rust_carnix-0.10.0
</pre>

<p>
But from this example so far, we see that user environments are comprised of
symbolic link "forests" of the packages that make up the current profile.
</p>

<p>
Let's follow this example again, however, we going to modify the user
environment by adding a package:
</p>

<pre class="example">
% nix-env -i autogen
</pre>

<p>
Starting with second link:
</p>

<pre class="example">
% ls -l /nix/var/nix/profiles/per-user/kb/profile
lrwxrwxrwx 1 kb users 14 Aug 13 05:52 /nix/var/nix/profiles/per-user/kb/profile -&gt; profile-4-link
</pre>

<p>
The profile link now points to a different link.  Let's keep going:
</p>

<pre class="example">
% ls -l /nix/var/nix/profiles/per-user/kb/profile-4-link
lrwxrwxrwx 1 kb users 60 Aug 13 05:52 /nix/var/nix/profiles/per-user/kb/profile-4-link -&gt; /nix/store/xslnn9gs5gkgdvzgb0w3b0iggbsszag5-user-environment
</pre>

<p>
The user-profile now points to a completely different symlink forest in the
<a href="https://nixos.org/nix/">Nix</a> store.
</p>

<p>
The old profile still exists.  Let's switch (rollback) to it:
</p>

<pre class="example">
% nix-env --rollback                                                (1)
switching from generation 4 to 3
% ls -l /nix/var/nix/profiles/per-user/kb/profile
lrwxrwxrwx 1 kb users 14 Aug 13 05:56 /nix/var/nix/profiles/per-user/kb/profile -&gt; profile-3-link
% ls -l /nix/var/nix/profiles/per-user/kb/profile-3-link
lrwxrwxrwx 1 kb users 60 Jul 30 15:15 /nix/var/nix/profiles/per-user/kb/profile-3-link -&gt; /nix/store/d7d6hcv8v2crb98nhh00nrr2bkh034kc-user-environment
</pre>

<p>
Rolling back to a previous profile was effortless and we went back to <span class="underline">exactly</span>
the same store path that we had previously.
</p>

<p>
Since the <a href="http://man7.org/linux/man-pages/man2/symlink.2.html"><code>symlink(2)</code></a> operation is atomic, changing profile
generations is atomic.  Adding a package to the profile is atomic: that is,
once the package is downloaded, built, added to the store, and the set of links
are compiled into a new profile, the switch to this new profile is entirely
atomic.  If the any of the previous steps fail, the user profile is not
adversely affected.
</p>
</div>
</div>
