blog/2019/07/nixos/index.org
*** System Profiles
:PROPERTIES:
:ID:       32b83c94-6bfc-4ef0-90d9-5f01db970330
:END:

After user profiles, we are left with system profiles.  What exactly is
[[nixos][NixOS]]?  If any of the above provides any foreshadowing, the answer
may seem obvious: a system profile is a forest of symbolic links to the
packages, services, and other system configuration that comprise a
[[gnu][GNU]]/[[linux][Linux]] system.

However, that may not be obvious.

Let's start by first reiterating that [[nixos][NixOS]] is different than
traditional [[gnu][GNU]]/[[linux][Linux]] distributions, very different.  One
of the most notable differences that is important to this discussion is the
lack of adherence to the [[fhs][Filesystem Hierarchy Standard]].  Chiefly, in
the root of the filesystem of a [[nixos][NixOS]] system, there is almost no
need for ~/bin~, ~/usr~, and ~/lib~.

#+begin_example
% ls -l /
total 57
drwxr-xr-x   2 root root  4096 Aug  2 09:04 bin
drwxr-xr-x   5 root root  1024 Jun  5 17:01 boot
drwxr-xr-x  21 root root  4140 Aug 13 05:37 dev
drwxr-xr-x  26 root root  4096 Aug  2 09:04 etc
drwxr-xr-x   3 root root    19 May 16 10:54 gnu
drwxr-xr-x   3 root root    29 May  8 07:24 home
drwx------   2 root root 16384 Jun  5 16:02 lost+found
drwxr-xr-x   4 root root    30 May 16 09:49 nix
drwxr-xr-x   5 root root  4096 Jun  5 20:01 opt
dr-xr-xr-x 257 root root     0 Aug  2 09:03 proc
drwx------   6 root root  4096 Aug 12 23:04 root
drwxr-xr-x  20 root root   640 Aug 14 20:56 run
dr-xr-xr-x  13 root root     0 Aug  2 09:03 sys
drwxrwxrwt  55 root root 16384 Aug 14 21:00 tmp
drwxr-xr-x   3 root root  4096 Jun  5 17:01 usr
drwxr-xr-x   9 root root  4096 Aug  2 09:04 var
#+end_example

In the above output, there /is/ both ~/bin~ and ~/usr~, but no ~/lib~.  What is
in ~/bin~ and ~/usr~?  Two things: one, ~/bin/sh~ and two, ~/usr/bin/env~.
These are kept around as ways to resolve issues with porting packages into the
[[nix][Nix]] environment.

#+begin_example
% ls -l /bin/
total 4
lrwxrwxrwx 1 root root 75 Aug  2 09:04 sh -> /nix/store/93h01q6yg13xdrabvqbddzbk11w6a928-bash-interactive-4.4-p23/bin/sh
% ls -lR /usr
/usr:
total 4
drwxr-xr-x 2 root root 4096 Aug  2 09:04 bin
/usr/bin:
total 4
lrwxrwxrwx 1 root root 66 Aug  2 09:04 env -> /nix/store/d9s1kq1bnwqgxwcvv4zrc36ysnxg8gv7-coreutils-8.30/bin/env
#+end_example

Notice, however, that these files are in fact symbolic links into the
[[nix][Nix]] store.

If there is nothing in ~/bin~ and nothing in ~/usr~, where does the system find
all of the install programs?

The answer: ~/run/current-system~:

#+begin_example
% ls -l /run/current-system
lrwxrwxrwx 1 root root 88 Aug  2 09:04 /run/current-system -> /nix/store/9c3k3ky5lg3x937984902v1d7148m7c5-nixos-system-phenex-19.03.173147.77295b0bd26
% ls -l /nix/store/9c3k3ky5lg3x937984902v1d7148m7c5-nixos-system-phenex-19.03.173147.77295b0bd26
total 48
-r-xr-xr-x 1 root root 16455 Dec 31  1969 activate
lrwxrwxrwx 1 root root    91 Dec 31  1969 append-initrd-secrets -> /nix/store/vynm9pvxlzd8rracmmkhpj2a3g79whbw-append-initrd-secrets/bin/append-initrd-secrets
dr-xr-xr-x 2 root root    37 Dec 31  1969 bin
-r--r--r-- 1 root root     0 Dec 31  1969 configuration-name
lrwxrwxrwx 1 root root    51 Dec 31  1969 etc -> /nix/store/a04f5cdfinc8p4n6x0hw9a0jn5l2mi9i-etc/etc
-r--r--r-- 1 root root    57 Dec 31  1969 extra-dependencies
dr-xr-xr-x 2 root root     6 Dec 31  1969 fine-tune
lrwxrwxrwx 1 root root    65 Dec 31  1969 firmware -> /nix/store/ak22608y0db7m4bzwmps23gi4f0s13dc-firmware/lib/firmware
-r-xr-xr-x 1 root root  5568 Dec 31  1969 init
-r--r--r-- 1 root root     9 Dec 31  1969 init-interface-version
lrwxrwxrwx 1 root root    57 Dec 31  1969 initrd -> /nix/store/n7x32hhg41mflx9xvmmw61piwjdr81m1-initrd/initrd
lrwxrwxrwx 1 root root    65 Dec 31  1969 kernel -> /nix/store/sgkk7pqh7jqvy6rvgnkk367amrpknw91-linux-4.19.59/bzImage
lrwxrwxrwx 1 root root    58 Dec 31  1969 kernel-modules -> /nix/store/nrmlrwxyqmp4dbcldrlvibv0h61356bf-kernel-modules
-r--r--r-- 1 root root    10 Dec 31  1969 kernel-params
-r--r--r-- 1 root root    24 Dec 31  1969 nixos-version
lrwxrwxrwx 1 root root    55 Dec 31  1969 sw -> /nix/store/11pfbzzamqvnbfxis4pbnzhrvarn3pj1-system-path
-r--r--r-- 1 root root    12 Dec 31  1969 system
lrwxrwxrwx 1 root root    64 Dec 31  1969 systemd -> /nix/store/9zkhhvix7rlqlj8pf8s2kbw8b88rky75-systemd-239.20190219
#+end_example

The various files and directories in this derivation are what is necessary for
the current generation of the system.  Similar to user environments, upgrades
and rollbacks are atomic.  Installing a package into the system packages, for
example, will happen in isolation.  Only after the build process is complete
and successful does the forest of links get changed.

However, because there is some necessary artifacts of state when running a
system, this isolation is certainly not perfect.  Particularly so with the
interaction of services and their underlying configuration.

** Alternatives
:PROPERTIES:
:ID:       a9f063d9-2e50-462b-b7c7-1e06e8dcdbc6
:END:

Aside from [[nixos][NixOS]], there is also [[guix][Guix]], a [[gnu][GNU]]
alternative to [[nix][Nix]] and [[nixos][NixOS]].  Many of the ideas of
[[guix][Guix]] are derived from [[nix][Nix]].  In fact, early on in the life of
the [[guix][Guix]] project, [[guix][Guix]] interacted with the [[nix][Nix]]
daemon directly.  This is no longer the case as [[guix][Guix]] has its own
daemon now, however, the design is very similar.

The configuration language of [[guix][Guix]] is, in proper [[gnu][GNU]] style,
[[guile-scheme][Guile Scheme]] instead of a [[wiki-dsl][DSL]]--
[[nix-expressions][nix]].

[[guix][Guix]], as a [[gnu][GNU]] project, also takes a hard-line stance on
software freedom and therefore does not and will not include any non-free code
in the package repositories.  Furthermore, this also means that [[guix][Guix]]
the package manager will not be supported on other operating systems such as
Apple MacOS and Microsoft Windows.

Another alternative is using any number of
[[configuration-management-wiki][Configuration Management]] solutions on a
typical [[gnu][GNU]]/[[linux][Linux]] distribution.  However, solutions such as
[[ansible][Ansible]], [[puppet][Puppet]], and [[salt-stack][Salt]] fail in a
very similar way that tradition distrubtions fail: they are dependent on
ordering and distrubtion managers and software maintainers to create
appropriate software dependency graphs.  Failure in dependency management
yields failures in the system.  Furthermore, once a package is no longer
available in the official repositories, it is no longer trivially available to
be installed via the software configuration tools.

