blog/2019/07/nixos/index.org
** Impressions and Thoughts
:PROPERTIES:
:ID:       845c7afd-defe-4838-8fbc-814cf7e42b78
:END:

[[nix][Nix]] and by extension [[nixos][NixOS]] (hopefully) solve some really
annoying problems I tend to keep running into when developing software and
immutable, reproducible infrastructure.  I'm really excited about the
possibilities [[nix][Nix]] can bring.  However, until I can really sit down and
_use_ [[nix][Nix]] for development, I can't say anything with certainty.

In time, I will provide more detail on my impressions and review [[nix][Nix]]
and [[nixos][NixOS]] in more depth.  However, if nothing else, being able to
codify systems and environments in a reproducible manner is already a huge win.

I highly recommend reading [[nixos-paper][NixOS: A Purely Functional Linux
Distribution]] and [[nix-paper][Nix: A Safe and Policy-Free System for Software
Development]] by Dolstra /et al./.  Both papers are very good explanations and
breakdowns of the motivation and ideas behind [[nix][Nix]] and
[[nixos][NixOS]].
