blog/2019/07/nixos/index.html

<div id="outline-container-orgdc162e6" class="outline-2">
<h2 id="orgdc162e6">Impressions and Thoughts</h2>
<div class="outline-text-2" id="text-orgdc162e6">
<p>
<a href="https://nixos.org/nix/">Nix</a> and by extension <a href="https://nixos.org/">NixOS</a> (hopefully) solve some really
annoying problems I tend to keep running into when developing software and
immutable, reproducible infrastructure.  I'm really excited about the
possibilities <a href="https://nixos.org/nix/">Nix</a> can bring.  However, until I can really sit down and
<span class="underline">use</span> <a href="https://nixos.org/nix/">Nix</a> for development, I can't say anything with certainty.
</p>

<p>
In time, I will provide more detail on my impressions and review <a href="https://nixos.org/nix/">Nix</a>
and <a href="https://nixos.org/">NixOS</a> in more depth.  However, if nothing else, being able to
codify systems and environments in a reproducible manner is already a huge win.
</p>

<p>
I highly recommend reading <a href="https://nixos.org/~eelco/pubs/nixos-icfp2008-final.pdf">NixOS: A Purely Functional Linux
Distribution</a> and <a href="https://www.usenix.org/legacy/events/lisa04/tech/full_papers/dolstra/dolstra.pdf">Nix: A Safe and Policy-Free System for Software
Development</a> by Dolstra <i>et al.</i>.  Both papers are very good explanations and
breakdowns of the motivation and ideas behind <a href="https://nixos.org/nix/">Nix</a> and
<a href="https://nixos.org/">NixOS</a>.
</p>
</div>
</div>
</div>
<footer id="" class="status">
<footer>
  <p>&copy; 2014-2023 Kenny Ballou.
    <a href="http://creativecommons.org/licenses/by-nc-sa/4.0/">Some rights
      reserved.</a></p>
  <p>Powered by <a href="https://gnu.org">GNU/Linux</a></p>
</footer>
</footer>
</body>
</html>
